{
  "websites": [
    {
      "id": "1",
      "image": "../images/keurig-website.png",
      "title": "Keurig Website Re-creation",
      "sub": "N315 Advanced Multi-Device Web Development Final Project, 2021",
      "desc": "A re-creation of the Keurig e-commerce site that sells coffee makers and allows users to sign up with their first name, last name, email, and password. They can also login and logout easily based on user feedback. Once a user is logged in, they are able to add multiple items to their cart, remove items from their cart, and checkout. This website is fully responsive and uses various development tools such as Firebase.",
      "link": "https://n315-jt-fa21.web.app/"
    },
    {
      "id": "2",
      "image": "../images/arabee-website.png",
      "title": "AraBee Language Program",
      "sub": "N423 Database Development for Mobile Applications Final Project, 2021",
      "desc": "This application is built as a program to help students learn the language of Arabic. Anyone can create an account to this page using thier first and last name, email, and a password. A user is able to browse the culture, tutorials, and view their own flashcards. Once signed in, a user is able to create, read, update, and delete their flashcards freely. In general, this is a user friendly and bright website to encourage students while learning. This is an original design I created in Adobe XD and built by implementing the Firebase platform.",
      "link": "https://n423-jt-fa21.web.app/"
    },
    {
      "id": "3",
      "image": "../images/skincare.png",
      "title": "Julie's Skincare Store",
      "sub": "N320 Intermediate Media Application Development Final Project, 2020",
      "desc": "An original, single-page application created in Codesandbox using primarily the Vue.js and Vuex programming frameworks. This site showcases several different types of skincare products and their details in a simple and aesthetic display. It features various images, JSON data files, and greensock animations. This application is also fully responsive.",
      "link": "https://2p1y0.csb.app/"
    },
    {
      "id": "4",
      "image": "../images/weatherU-app.png",
      "title": "WeatherU Application",
      "sub": "Weather API Interface, 2022",
      "desc": "An original weather application design that shows various data points including average temperature, humidity, and total precipitation. WeatherU implements a RESTful backend API for storing and retrieving data via AJAX calls. All the weather and location data is collected from weatherapi.com. This application includes a simple search bar and was developed using JavaScript, JQuery, and SCSS. It is also fully responsive.",
      "link": "https://in-info-web4.informatics.iupui.edu/~jtadrous/N423/homework-two/"
    },
    {
      "id": "5",
      "image": "../images/travel-fly-home.png",
      "title": "Travel Fly Website",
      "sub": "MVC Web Application, 2021",
      "desc": "A fully-functioning website for travel information and booking called Travel Fly. This single-page application was developed using the MVC model and implemented HTML, CSS, JavaScript, and JQuery. The design files for this website were provided by my professor and I was tasked with re-creating those designs by programming a new website and applying common web development practices. This website is also fully responsive.",
      "link": "https://in-info-web4.informatics.iupui.edu/~jtadrous/N215/homework-ten/"
    },
    {
      "id": "6",
      "image": "../images/capture-collective.png",
      "title": "Capture Collective Website",
      "sub": "MVC Web Application, 2021",
      "desc": "An original website design for a fictional photography company called Capture Collective. This single-page application was developed using the MVC model and implemented HTML, CSS, and basic JavaScript. It features various text, imagery, and inputs.",
      "link": "https://in-info-web4.informatics.iupui.edu/~jtadrous/N315/homework-two/"
    },
    {
      "id": "7",
      "image": "../images/plan-of-study.png",
      "title": "Informatics Plan of Study",
      "sub": "HTML5 Drag-and-Drop Application, 2018",
      "desc": "A web application created using HTML, CSS, and JavaScript. The Personalized Plan of Study is a website that allows Informatics students to pick and choose between courses and visually plan out their fours years of college. It features course boxes, color-coded categories, text input boxes, and HTML5 Drag-and-Drop. It also has 'Save', 'Reset', and 'Print' buttons at the bottom of the page.",
      "link": "../pages/websites/Scheduler/index.html"
    }
  ],
  "design": [
    {
      "id": "1",
      "image": "../images/elf-poster.jpg",
      "title": "E.L.F. Rebranding",
      "sub": "Digital Press Kit, 2022",
      "desc": "A full redesign of the E.L.F. cosmetics brand, including a website mockup, promotional video, and poster. The website mockup was designed in Adobe XD. The promotional video was edited in Adobe Premiere using various templates and transitions. Lastly, the poster was created in Adobe Illustrator. The typography, color scheme, and brand identity were considered in the redesign process.",
      "link": "../pages/design/elf_rebranding.html"
    },
    {
      "id": "2",
      "image": "../images/redline-gif.gif",
      "title": "RedLine Application",
      "sub": "I270 Introduction to Human-Computer Interaction Final Project, 2019",
      "desc": "An original wireframe of an application using Mockflow.com. The RedLine is a new bus system that runs from downtown Indy to the University of Indianapolis. This fictional application was designed to enhance the user experience, allow them to search points of interests, and buy tickets. It features a map, search bar, info cards with star reviews, and multiple payment methods.",
      "link": "../pages/design/redline.html"
    },
    {
      "id": "3",
      "image": "../images/book-front-cover.png",
      "title": "Typography",
      "sub": "V211 Typography Coursework, 2021",
      "desc": "A collection of projects and designs from the Typography Course in the Herron School of Art. Each project explores how typography is used as a mode of visual expression within visual communication design. The objective for project 1 was to craft a chosen word into a unique logotype through research and digital tools within Adobe Illustrator. The objective for project 2 was to create a short print publication that uses conventional, long-form typography using Adobe InDesign. The objective for project 3 was to create a unique poster for a type conference by exploring identity and using digital tools within Adobe Illustrator.",
      "link": "../pages/design/typography.html"
    },
    {
      "id": "4",
      "image": "../images/wine-advertisement.jpg",
      "title": "Digital Media",
      "sub": "N102 Digital Media Imagery Coursework, 2021",
      "desc": "A series of projects created in Adobe Photoshop and Illustrator for the Digital Media Imagery course offered at the School of Informatics and Computing. The objective of the design poster project was to create a poster that illustrated each of the 9 principles of design in a clear and eye-catching way. The objective of the unique advertisement project was to sell a product or idea in a clever way by mergeing type and imagery. The objective of the family crest project was to design a crest using symbols related to your culture and identity, and a color scheme based on a photo from nature. The objective of the digital eye painting was to draw a realistic image of your eyes using various painting tools within Photoshop.",
      "link": "../pages/design/digital_media.html"
    },
    {
      "id": "5",
      "image": "../images/mafiacent-poster.jpg",
      "title": "Making Meaning",
      "sub": "V201 Making Meaning Coursework, 2021",
      "desc": "A collection of projects and designs from the Making Meaning Course in the Herron School of Art. The objective of project 1 was to study the function and movement of an everyday tool and break it down to its simplest form to create a new design. The objective of project 2 was to develop a semiotic standard of signs and symbols that could be used in an existing or fictional facility through research and a study of common shapes and colors. The objective of project 3 was to design abstract images of two animals using simple shapes and colors. Then, create several frames of one animal conforming into the shape of the second animal to develop an animated gif. The objective of project 4 was to pick a movie and design a new poster for that movie through the lense of a completely different genre. All of these projects were created using Adobe Photoshop and Illustrator.",
      "link": "../pages/design/making_meaning.html"
    },
    {
      "id": "6",
      "image": "../images/julie-andrews.jpg",
      "title": "Drawings & Paintings",
      "sub": "Beginning Drawing and Painting Coursework, 2019—2022",
      "desc": "A series of artwork created during the Beginning Drawing I, Beginning Drawing II, and Beginning Painting I courses offered at the Herron School of Art. Most paintings were created using oil-based paints and fine brushes. Most drawings were created using charcoal sticks and graphite pencils.",
      "link": "../pages/design/drawings.html"
    },
    {
      "id": "7",
      "image": "../images/bubble-bobble-game.png",
      "title": "Bubble Bobble",
      "sub": "Stop Motion Animation, 2018",
      "desc": "A stop motion animation of the iconic Bubble Bobble game. The objective of this project was to recreate our favorite vintage video games through the use of stop motion. All of the graphics were printed out and placed on a board. The video features 362 different images, which were edited and sequenced in Adobe After Effects.",
      "link": "../pages/design/bubble_bobble.html"
    }
  ]
}
